podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK11D5WS.h
/**
* @addtogroup RTC_Register_Masks_GROUP RTC Register Masks
* @brief Register Masks for RTC
* @{
*/
/* ------- TSR Bit Fields                           ------ */
#define RTC_TSR_TSR_MASK                         (0xFFFFFFFFU)                                       /*!< RTC_TSR.TSR Mask                        */
#define RTC_TSR_TSR_SHIFT                        (0U)                                                /*!< RTC_TSR.TSR Position                    */
#define RTC_TSR_TSR(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< RTC_TSR.TSR Field                       */
/* ------- TPR Bit Fields                           ------ */
#define RTC_TPR_TPR_MASK                         (0xFFFFU)                                           /*!< RTC_TPR.TPR Mask                        */
#define RTC_TPR_TPR_SHIFT                        (0U)                                                /*!< RTC_TPR.TPR Position                    */
#define RTC_TPR_TPR(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFUL)        /*!< RTC_TPR.TPR Field                       */
/* ------- TAR Bit Fields                           ------ */
#define RTC_TAR_TAR_MASK                         (0xFFFFFFFFU)                                       /*!< RTC_TAR.TAR Mask                        */
#define RTC_TAR_TAR_SHIFT                        (0U)                                                /*!< RTC_TAR.TAR Position                    */
#define RTC_TAR_TAR(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< RTC_TAR.TAR Field                       */
/* ------- TCR Bit Fields                           ------ */
#define RTC_TCR_TCR_MASK                         (0xFFU)                                             /*!< RTC_TCR.TCR Mask                        */
#define RTC_TCR_TCR_SHIFT                        (0U)                                                /*!< RTC_TCR.TCR Position                    */
#define RTC_TCR_TCR(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0xFFUL)          /*!< RTC_TCR.TCR Field                       */
#define RTC_TCR_CIR_MASK                         (0xFF00U)                                           /*!< RTC_TCR.CIR Mask                        */
#define RTC_TCR_CIR_SHIFT                        (8U)                                                /*!< RTC_TCR.CIR Position                    */
#define RTC_TCR_CIR(x)                           (((uint32_t)(((uint32_t)(x))<<8U))&0xFF00UL)        /*!< RTC_TCR.CIR Field                       */
#define RTC_TCR_TCV_MASK                         (0xFF0000U)                                         /*!< RTC_TCR.TCV Mask                        */
#define RTC_TCR_TCV_SHIFT                        (16U)                                               /*!< RTC_TCR.TCV Position                    */
#define RTC_TCR_TCV(x)                           (((uint32_t)(((uint32_t)(x))<<16U))&0xFF0000UL)     /*!< RTC_TCR.TCV Field                       */
#define RTC_TCR_CIC_MASK                         (0xFF000000U)                                       /*!< RTC_TCR.CIC Mask                        */
#define RTC_TCR_CIC_SHIFT                        (24U)                                               /*!< RTC_TCR.CIC Position                    */
#define RTC_TCR_CIC(x)                           (((uint32_t)(((uint32_t)(x))<<24U))&0xFF000000UL)   /*!< RTC_TCR.CIC Field                       */
/* ------- CR Bit Fields                            ------ */
#define RTC_CR_SWR_MASK                          (0x1U)                                              /*!< RTC_CR.SWR Mask                         */
#define RTC_CR_SWR_SHIFT                         (0U)                                                /*!< RTC_CR.SWR Position                     */
#define RTC_CR_SWR(x)                            (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< RTC_CR.SWR Field                        */
#define RTC_CR_WPE_MASK                          (0x2U)                                              /*!< RTC_CR.WPE Mask                         */
#define RTC_CR_WPE_SHIFT                         (1U)                                                /*!< RTC_CR.WPE Position                     */
#define RTC_CR_WPE(x)                            (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< RTC_CR.WPE Field                        */
#define RTC_CR_SUP_MASK                          (0x4U)                                              /*!< RTC_CR.SUP Mask                         */
#define RTC_CR_SUP_SHIFT                         (2U)                                                /*!< RTC_CR.SUP Position                     */
#define RTC_CR_SUP(x)                            (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< RTC_CR.SUP Field                        */
#define RTC_CR_UM_MASK                           (0x8U)                                              /*!< RTC_CR.UM Mask                          */
#define RTC_CR_UM_SHIFT                          (3U)                                                /*!< RTC_CR.UM Position                      */
#define RTC_CR_UM(x)                             (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_CR.UM Field                         */
#define RTC_CR_OSCE_MASK                         (0x100U)                                            /*!< RTC_CR.OSCE Mask                        */
#define RTC_CR_OSCE_SHIFT                        (8U)                                                /*!< RTC_CR.OSCE Position                    */
#define RTC_CR_OSCE(x)                           (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< RTC_CR.OSCE Field                       */
#define RTC_CR_CLKO_MASK                         (0x200U)                                            /*!< RTC_CR.CLKO Mask                        */
#define RTC_CR_CLKO_SHIFT                        (9U)                                                /*!< RTC_CR.CLKO Position                    */
#define RTC_CR_CLKO(x)                           (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< RTC_CR.CLKO Field                       */
#define RTC_CR_SCP_MASK                          (0x3C00U)                                           /*!< RTC_CR.SCP Mask                         */
#define RTC_CR_SCP_SHIFT                         (10U)                                               /*!< RTC_CR.SCP Position                     */
#define RTC_CR_SCP(x)                            (((uint32_t)(((uint32_t)(x))<<10U))&0x3C00UL)       /*!< RTC_CR.SCP Field                        */
#define RTC_CR_SC16P_MASK                        (0x400U)                                            /*!< RTC_CR.SC16P Mask                       */
#define RTC_CR_SC16P_SHIFT                       (10U)                                               /*!< RTC_CR.SC16P Position                   */
#define RTC_CR_SC16P(x)                          (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< RTC_CR.SC16P Field                      */
#define RTC_CR_SC8P_MASK                         (0x800U)                                            /*!< RTC_CR.SC8P Mask                        */
#define RTC_CR_SC8P_SHIFT                        (11U)                                               /*!< RTC_CR.SC8P Position                    */
#define RTC_CR_SC8P(x)                           (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< RTC_CR.SC8P Field                       */
#define RTC_CR_SC4P_MASK                         (0x1000U)                                           /*!< RTC_CR.SC4P Mask                        */
#define RTC_CR_SC4P_SHIFT                        (12U)                                               /*!< RTC_CR.SC4P Position                    */
#define RTC_CR_SC4P(x)                           (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< RTC_CR.SC4P Field                       */
#define RTC_CR_SC2P_MASK                         (0x2000U)                                           /*!< RTC_CR.SC2P Mask                        */
#define RTC_CR_SC2P_SHIFT                        (13U)                                               /*!< RTC_CR.SC2P Position                    */
#define RTC_CR_SC2P(x)                           (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< RTC_CR.SC2P Field                       */
/* ------- SR Bit Fields                            ------ */
#define RTC_SR_TIF_MASK                          (0x1U)                                              /*!< RTC_SR.TIF Mask                         */
#define RTC_SR_TIF_SHIFT                         (0U)                                                /*!< RTC_SR.TIF Position                     */
#define RTC_SR_TIF(x)                            (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< RTC_SR.TIF Field                        */
#define RTC_SR_TOF_MASK                          (0x2U)                                              /*!< RTC_SR.TOF Mask                         */
#define RTC_SR_TOF_SHIFT                         (1U)                                                /*!< RTC_SR.TOF Position                     */
#define RTC_SR_TOF(x)                            (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< RTC_SR.TOF Field                        */
#define RTC_SR_TAF_MASK                          (0x4U)                                              /*!< RTC_SR.TAF Mask                         */
#define RTC_SR_TAF_SHIFT                         (2U)                                                /*!< RTC_SR.TAF Position                     */
#define RTC_SR_TAF(x)                            (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< RTC_SR.TAF Field                        */
#define RTC_SR_MOF_MASK                          (0x8U)                                              /*!< RTC_SR.MOF Mask                         */
#define RTC_SR_MOF_SHIFT                         (3U)                                                /*!< RTC_SR.MOF Position                     */
#define RTC_SR_MOF(x)                            (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_SR.MOF Field                        */
#define RTC_SR_TCE_MASK                          (0x10U)                                             /*!< RTC_SR.TCE Mask                         */
#define RTC_SR_TCE_SHIFT                         (4U)                                                /*!< RTC_SR.TCE Position                     */
#define RTC_SR_TCE(x)                            (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_SR.TCE Field                        */
/* ------- LR Bit Fields                            ------ */
#define RTC_LR_TCL_MASK                          (0x8U)                                              /*!< RTC_LR.TCL Mask                         */
#define RTC_LR_TCL_SHIFT                         (3U)                                                /*!< RTC_LR.TCL Position                     */
#define RTC_LR_TCL(x)                            (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_LR.TCL Field                        */
#define RTC_LR_CRL_MASK                          (0x10U)                                             /*!< RTC_LR.CRL Mask                         */
#define RTC_LR_CRL_SHIFT                         (4U)                                                /*!< RTC_LR.CRL Position                     */
#define RTC_LR_CRL(x)                            (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_LR.CRL Field                        */
#define RTC_LR_SRL_MASK                          (0x20U)                                             /*!< RTC_LR.SRL Mask                         */
#define RTC_LR_SRL_SHIFT                         (5U)                                                /*!< RTC_LR.SRL Position                     */
#define RTC_LR_SRL(x)                            (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< RTC_LR.SRL Field                        */
#define RTC_LR_LRL_MASK                          (0x40U)                                             /*!< RTC_LR.LRL Mask                         */
#define RTC_LR_LRL_SHIFT                         (6U)                                                /*!< RTC_LR.LRL Position                     */
#define RTC_LR_LRL(x)                            (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< RTC_LR.LRL Field                        */
#define RTC_LR_TTSL_MASK                         (0x100U)                                            /*!< RTC_LR.TTSL Mask                        */
#define RTC_LR_TTSL_SHIFT                        (8U)                                                /*!< RTC_LR.TTSL Position                    */
#define RTC_LR_TTSL(x)                           (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< RTC_LR.TTSL Field                       */
#define RTC_LR_MEL_MASK                          (0x200U)                                            /*!< RTC_LR.MEL Mask                         */
#define RTC_LR_MEL_SHIFT                         (9U)                                                /*!< RTC_LR.MEL Position                     */
#define RTC_LR_MEL(x)                            (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< RTC_LR.MEL Field                        */
#define RTC_LR_MCLL_MASK                         (0x400U)                                            /*!< RTC_LR.MCLL Mask                        */
#define RTC_LR_MCLL_SHIFT                        (10U)                                               /*!< RTC_LR.MCLL Position                    */
#define RTC_LR_MCLL(x)                           (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< RTC_LR.MCLL Field                       */
#define RTC_LR_MCHL_MASK                         (0x800U)                                            /*!< RTC_LR.MCHL Mask                        */
#define RTC_LR_MCHL_SHIFT                        (11U)                                               /*!< RTC_LR.MCHL Position                    */
#define RTC_LR_MCHL(x)                           (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< RTC_LR.MCHL Field                       */
#define RTC_LR_TEL_MASK                          (0x1000U)                                           /*!< RTC_LR.TEL Mask                         */
#define RTC_LR_TEL_SHIFT                         (12U)                                               /*!< RTC_LR.TEL Position                     */
#define RTC_LR_TEL(x)                            (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< RTC_LR.TEL Field                        */
#define RTC_LR_TDL_MASK                          (0x2000U)                                           /*!< RTC_LR.TDL Mask                         */
#define RTC_LR_TDL_SHIFT                         (13U)                                               /*!< RTC_LR.TDL Position                     */
#define RTC_LR_TDL(x)                            (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< RTC_LR.TDL Field                        */
#define RTC_LR_TTL_MASK                          (0x4000U)                                           /*!< RTC_LR.TTL Mask                         */
#define RTC_LR_TTL_SHIFT                         (14U)                                               /*!< RTC_LR.TTL Position                     */
#define RTC_LR_TTL(x)                            (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< RTC_LR.TTL Field                        */
#define RTC_LR_TIL_MASK                          (0x8000U)                                           /*!< RTC_LR.TIL Mask                         */
#define RTC_LR_TIL_SHIFT                         (15U)                                               /*!< RTC_LR.TIL Position                     */
#define RTC_LR_TIL(x)                            (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< RTC_LR.TIL Field                        */
/* ------- IER Bit Fields                           ------ */
#define RTC_IER_TIIE_MASK                        (0x1U)                                              /*!< RTC_IER.TIIE Mask                       */
#define RTC_IER_TIIE_SHIFT                       (0U)                                                /*!< RTC_IER.TIIE Position                   */
#define RTC_IER_TIIE(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< RTC_IER.TIIE Field                      */
#define RTC_IER_TOIE_MASK                        (0x2U)                                              /*!< RTC_IER.TOIE Mask                       */
#define RTC_IER_TOIE_SHIFT                       (1U)                                                /*!< RTC_IER.TOIE Position                   */
#define RTC_IER_TOIE(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< RTC_IER.TOIE Field                      */
#define RTC_IER_TAIE_MASK                        (0x4U)                                              /*!< RTC_IER.TAIE Mask                       */
#define RTC_IER_TAIE_SHIFT                       (2U)                                                /*!< RTC_IER.TAIE Position                   */
#define RTC_IER_TAIE(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< RTC_IER.TAIE Field                      */
#define RTC_IER_MOIE_MASK                        (0x8U)                                              /*!< RTC_IER.MOIE Mask                       */
#define RTC_IER_MOIE_SHIFT                       (3U)                                                /*!< RTC_IER.MOIE Position                   */
#define RTC_IER_MOIE(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_IER.MOIE Field                      */
#define RTC_IER_TSIE_MASK                        (0x10U)                                             /*!< RTC_IER.TSIE Mask                       */
#define RTC_IER_TSIE_SHIFT                       (4U)                                                /*!< RTC_IER.TSIE Position                   */
#define RTC_IER_TSIE(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_IER.TSIE Field                      */
#define RTC_IER_WPON_MASK                        (0x80U)                                             /*!< RTC_IER.WPON Mask                       */
#define RTC_IER_WPON_SHIFT                       (7U)                                                /*!< RTC_IER.WPON Position                   */
#define RTC_IER_WPON(x)                          (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< RTC_IER.WPON Field                      */
/* ------- TTSR Bit Fields                          ------ */
#define RTC_TTSR_TTS_MASK                        (0xFFFFFFFFU)                                       /*!< RTC_TTSR.TTS Mask                       */
#define RTC_TTSR_TTS_SHIFT                       (0U)                                                /*!< RTC_TTSR.TTS Position                   */
#define RTC_TTSR_TTS(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< RTC_TTSR.TTS Field                      */
/* ------- MER Bit Fields                           ------ */
#define RTC_MER_MCE_MASK                         (0x10U)                                             /*!< RTC_MER.MCE Mask                        */
#define RTC_MER_MCE_SHIFT                        (4U)                                                /*!< RTC_MER.MCE Position                    */
#define RTC_MER_MCE(x)                           (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_MER.MCE Field                       */
/* ------- MCLR Bit Fields                          ------ */
#define RTC_MCLR_MCL_MASK                        (0xFFFFFFFFU)                                       /*!< RTC_MCLR.MCL Mask                       */
#define RTC_MCLR_MCL_SHIFT                       (0U)                                                /*!< RTC_MCLR.MCL Position                   */
#define RTC_MCLR_MCL(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< RTC_MCLR.MCL Field                      */
/* ------- MCHR Bit Fields                          ------ */
#define RTC_MCHR_MCH_MASK                        (0xFFFFFFFFU)                                       /*!< RTC_MCHR.MCH Mask                       */
#define RTC_MCHR_MCH_SHIFT                       (0U)                                                /*!< RTC_MCHR.MCH Position                   */
#define RTC_MCHR_MCH(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0xFFFFFFFFUL)    /*!< RTC_MCHR.MCH Field                      */
/* ------- TER Bit Fields                           ------ */
#define RTC_TER_DTE_MASK                         (0x1U)                                              /*!< RTC_TER.DTE Mask                        */
#define RTC_TER_DTE_SHIFT                        (0U)                                                /*!< RTC_TER.DTE Position                    */
#define RTC_TER_DTE(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< RTC_TER.DTE Field                       */
#define RTC_TER_VTE_MASK                         (0x2U)                                              /*!< RTC_TER.VTE Mask                        */
#define RTC_TER_VTE_SHIFT                        (1U)                                                /*!< RTC_TER.VTE Position                    */
#define RTC_TER_VTE(x)                           (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< RTC_TER.VTE Field                       */
#define RTC_TER_CTE_MASK                         (0x4U)                                              /*!< RTC_TER.CTE Mask                        */
#define RTC_TER_CTE_SHIFT                        (2U)                                                /*!< RTC_TER.CTE Position                    */
#define RTC_TER_CTE(x)                           (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< RTC_TER.CTE Field                       */
#define RTC_TER_TTE_MASK                         (0x8U)                                              /*!< RTC_TER.TTE Mask                        */
#define RTC_TER_TTE_SHIFT                        (3U)                                                /*!< RTC_TER.TTE Position                    */
#define RTC_TER_TTE(x)                           (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_TER.TTE Field                       */
#define RTC_TER_FSE_MASK                         (0x10U)                                             /*!< RTC_TER.FSE Mask                        */
#define RTC_TER_FSE_SHIFT                        (4U)                                                /*!< RTC_TER.FSE Position                    */
#define RTC_TER_FSE(x)                           (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_TER.FSE Field                       */
#define RTC_TER_TME_MASK                         (0x20U)                                             /*!< RTC_TER.TME Mask                        */
#define RTC_TER_TME_SHIFT                        (5U)                                                /*!< RTC_TER.TME Position                    */
#define RTC_TER_TME(x)                           (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< RTC_TER.TME Field                       */
/* ------- TDR Bit Fields                           ------ */
#define RTC_TDR_DTF_MASK                         (0x1U)                                              /*!< RTC_TDR.DTF Mask                        */
