podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MK11D5WS.h
#define RTC_TDR_DTF_SHIFT                        (0U)                                                /*!< RTC_TDR.DTF Position                    */
#define RTC_TDR_DTF(x)                           (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< RTC_TDR.DTF Field                       */
#define RTC_TDR_VTF_MASK                         (0x2U)                                              /*!< RTC_TDR.VTF Mask                        */
#define RTC_TDR_VTF_SHIFT                        (1U)                                                /*!< RTC_TDR.VTF Position                    */
#define RTC_TDR_VTF(x)                           (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< RTC_TDR.VTF Field                       */
#define RTC_TDR_CTF_MASK                         (0x4U)                                              /*!< RTC_TDR.CTF Mask                        */
#define RTC_TDR_CTF_SHIFT                        (2U)                                                /*!< RTC_TDR.CTF Position                    */
#define RTC_TDR_CTF(x)                           (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< RTC_TDR.CTF Field                       */
#define RTC_TDR_TTF_MASK                         (0x8U)                                              /*!< RTC_TDR.TTF Mask                        */
#define RTC_TDR_TTF_SHIFT                        (3U)                                                /*!< RTC_TDR.TTF Position                    */
#define RTC_TDR_TTF(x)                           (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_TDR.TTF Field                       */
#define RTC_TDR_FSF_MASK                         (0x10U)                                             /*!< RTC_TDR.FSF Mask                        */
#define RTC_TDR_FSF_SHIFT                        (4U)                                                /*!< RTC_TDR.FSF Position                    */
#define RTC_TDR_FSF(x)                           (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_TDR.FSF Field                       */
#define RTC_TDR_TMF_MASK                         (0x20U)                                             /*!< RTC_TDR.TMF Mask                        */
#define RTC_TDR_TMF_SHIFT                        (5U)                                                /*!< RTC_TDR.TMF Position                    */
#define RTC_TDR_TMF(x)                           (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< RTC_TDR.TMF Field                       */
/* ------- TTR Bit Fields                           ------ */
#define RTC_TTR_VDTL_MASK                        (0x7U)                                              /*!< RTC_TTR.VDTL Mask                       */
#define RTC_TTR_VDTL_SHIFT                       (0U)                                                /*!< RTC_TTR.VDTL Position                   */
#define RTC_TTR_VDTL(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x7UL)           /*!< RTC_TTR.VDTL Field                      */
#define RTC_TTR_VDTH_MASK                        (0x38U)                                             /*!< RTC_TTR.VDTH Mask                       */
#define RTC_TTR_VDTH_SHIFT                       (3U)                                                /*!< RTC_TTR.VDTH Position                   */
#define RTC_TTR_VDTH(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x38UL)          /*!< RTC_TTR.VDTH Field                      */
#define RTC_TTR_CDTL_MASK                        (0x1C0U)                                            /*!< RTC_TTR.CDTL Mask                       */
#define RTC_TTR_CDTL_SHIFT                       (6U)                                                /*!< RTC_TTR.CDTL Position                   */
#define RTC_TTR_CDTL(x)                          (((uint32_t)(((uint32_t)(x))<<6U))&0x1C0UL)         /*!< RTC_TTR.CDTL Field                      */
#define RTC_TTR_CDTH_MASK                        (0xE00U)                                            /*!< RTC_TTR.CDTH Mask                       */
#define RTC_TTR_CDTH_SHIFT                       (9U)                                                /*!< RTC_TTR.CDTH Position                   */
#define RTC_TTR_CDTH(x)                          (((uint32_t)(((uint32_t)(x))<<9U))&0xE00UL)         /*!< RTC_TTR.CDTH Field                      */
#define RTC_TTR_TDTH_MASK                        (0x7000U)                                           /*!< RTC_TTR.TDTH Mask                       */
#define RTC_TTR_TDTH_SHIFT                       (12U)                                               /*!< RTC_TTR.TDTH Position                   */
#define RTC_TTR_TDTH(x)                          (((uint32_t)(((uint32_t)(x))<<12U))&0x7000UL)       /*!< RTC_TTR.TDTH Field                      */
#define RTC_TTR_TDTL_MASK                        (0x38000U)                                          /*!< RTC_TTR.TDTL Mask                       */
#define RTC_TTR_TDTL_SHIFT                       (15U)                                               /*!< RTC_TTR.TDTL Position                   */
#define RTC_TTR_TDTL(x)                          (((uint32_t)(((uint32_t)(x))<<15U))&0x38000UL)      /*!< RTC_TTR.TDTL Field                      */
/* ------- TIR Bit Fields                           ------ */
#define RTC_TIR_DTIE_MASK                        (0x1U)                                              /*!< RTC_TIR.DTIE Mask                       */
#define RTC_TIR_DTIE_SHIFT                       (0U)                                                /*!< RTC_TIR.DTIE Position                   */
#define RTC_TIR_DTIE(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< RTC_TIR.DTIE Field                      */
#define RTC_TIR_VTIE_MASK                        (0x2U)                                              /*!< RTC_TIR.VTIE Mask                       */
#define RTC_TIR_VTIE_SHIFT                       (1U)                                                /*!< RTC_TIR.VTIE Position                   */
#define RTC_TIR_VTIE(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< RTC_TIR.VTIE Field                      */
#define RTC_TIR_CTIE_MASK                        (0x4U)                                              /*!< RTC_TIR.CTIE Mask                       */
#define RTC_TIR_CTIE_SHIFT                       (2U)                                                /*!< RTC_TIR.CTIE Position                   */
#define RTC_TIR_CTIE(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< RTC_TIR.CTIE Field                      */
#define RTC_TIR_TTIE_MASK                        (0x8U)                                              /*!< RTC_TIR.TTIE Mask                       */
#define RTC_TIR_TTIE_SHIFT                       (3U)                                                /*!< RTC_TIR.TTIE Position                   */
#define RTC_TIR_TTIE(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_TIR.TTIE Field                      */
#define RTC_TIR_FSIE_MASK                        (0x10U)                                             /*!< RTC_TIR.FSIE Mask                       */
#define RTC_TIR_FSIE_SHIFT                       (4U)                                                /*!< RTC_TIR.FSIE Position                   */
#define RTC_TIR_FSIE(x)                          (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_TIR.FSIE Field                      */
#define RTC_TIR_TMIE_MASK                        (0x20U)                                             /*!< RTC_TIR.TMIE Mask                       */
#define RTC_TIR_TMIE_SHIFT                       (5U)                                                /*!< RTC_TIR.TMIE Position                   */
#define RTC_TIR_TMIE(x)                          (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< RTC_TIR.TMIE Field                      */
/* ------- WAR Bit Fields                           ------ */
#define RTC_WAR_TSRW_MASK                        (0x1U)                                              /*!< RTC_WAR.TSRW Mask                       */
#define RTC_WAR_TSRW_SHIFT                       (0U)                                                /*!< RTC_WAR.TSRW Position                   */
#define RTC_WAR_TSRW(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< RTC_WAR.TSRW Field                      */
#define RTC_WAR_TPRW_MASK                        (0x2U)                                              /*!< RTC_WAR.TPRW Mask                       */
#define RTC_WAR_TPRW_SHIFT                       (1U)                                                /*!< RTC_WAR.TPRW Position                   */
#define RTC_WAR_TPRW(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< RTC_WAR.TPRW Field                      */
#define RTC_WAR_TARW_MASK                        (0x4U)                                              /*!< RTC_WAR.TARW Mask                       */
#define RTC_WAR_TARW_SHIFT                       (2U)                                                /*!< RTC_WAR.TARW Position                   */
#define RTC_WAR_TARW(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< RTC_WAR.TARW Field                      */
#define RTC_WAR_TCRW_MASK                        (0x8U)                                              /*!< RTC_WAR.TCRW Mask                       */
#define RTC_WAR_TCRW_SHIFT                       (3U)                                                /*!< RTC_WAR.TCRW Position                   */
#define RTC_WAR_TCRW(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_WAR.TCRW Field                      */
#define RTC_WAR_CRW_MASK                         (0x10U)                                             /*!< RTC_WAR.CRW Mask                        */
#define RTC_WAR_CRW_SHIFT                        (4U)                                                /*!< RTC_WAR.CRW Position                    */
#define RTC_WAR_CRW(x)                           (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_WAR.CRW Field                       */
#define RTC_WAR_SRW_MASK                         (0x20U)                                             /*!< RTC_WAR.SRW Mask                        */
#define RTC_WAR_SRW_SHIFT                        (5U)                                                /*!< RTC_WAR.SRW Position                    */
#define RTC_WAR_SRW(x)                           (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< RTC_WAR.SRW Field                       */
#define RTC_WAR_LRW_MASK                         (0x40U)                                             /*!< RTC_WAR.LRW Mask                        */
#define RTC_WAR_LRW_SHIFT                        (6U)                                                /*!< RTC_WAR.LRW Position                    */
#define RTC_WAR_LRW(x)                           (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< RTC_WAR.LRW Field                       */
#define RTC_WAR_IERW_MASK                        (0x80U)                                             /*!< RTC_WAR.IERW Mask                       */
#define RTC_WAR_IERW_SHIFT                       (7U)                                                /*!< RTC_WAR.IERW Position                   */
#define RTC_WAR_IERW(x)                          (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< RTC_WAR.IERW Field                      */
#define RTC_WAR_TTSW_MASK                        (0x100U)                                            /*!< RTC_WAR.TTSW Mask                       */
#define RTC_WAR_TTSW_SHIFT                       (8U)                                                /*!< RTC_WAR.TTSW Position                   */
#define RTC_WAR_TTSW(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< RTC_WAR.TTSW Field                      */
#define RTC_WAR_MERW_MASK                        (0x200U)                                            /*!< RTC_WAR.MERW Mask                       */
#define RTC_WAR_MERW_SHIFT                       (9U)                                                /*!< RTC_WAR.MERW Position                   */
#define RTC_WAR_MERW(x)                          (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< RTC_WAR.MERW Field                      */
#define RTC_WAR_MCLW_MASK                        (0x400U)                                            /*!< RTC_WAR.MCLW Mask                       */
#define RTC_WAR_MCLW_SHIFT                       (10U)                                               /*!< RTC_WAR.MCLW Position                   */
#define RTC_WAR_MCLW(x)                          (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< RTC_WAR.MCLW Field                      */
#define RTC_WAR_MCHW_MASK                        (0x800U)                                            /*!< RTC_WAR.MCHW Mask                       */
#define RTC_WAR_MCHW_SHIFT                       (11U)                                               /*!< RTC_WAR.MCHW Position                   */
#define RTC_WAR_MCHW(x)                          (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< RTC_WAR.MCHW Field                      */
#define RTC_WAR_TERW_MASK                        (0x1000U)                                           /*!< RTC_WAR.TERW Mask                       */
#define RTC_WAR_TERW_SHIFT                       (12U)                                               /*!< RTC_WAR.TERW Position                   */
#define RTC_WAR_TERW(x)                          (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< RTC_WAR.TERW Field                      */
#define RTC_WAR_TDRW_MASK                        (0x2000U)                                           /*!< RTC_WAR.TDRW Mask                       */
#define RTC_WAR_TDRW_SHIFT                       (13U)                                               /*!< RTC_WAR.TDRW Position                   */
#define RTC_WAR_TDRW(x)                          (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< RTC_WAR.TDRW Field                      */
#define RTC_WAR_TTRW_MASK                        (0x4000U)                                           /*!< RTC_WAR.TTRW Mask                       */
#define RTC_WAR_TTRW_SHIFT                       (14U)                                               /*!< RTC_WAR.TTRW Position                   */
#define RTC_WAR_TTRW(x)                          (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< RTC_WAR.TTRW Field                      */
#define RTC_WAR_TIRW_MASK                        (0x8000U)                                           /*!< RTC_WAR.TIRW Mask                       */
#define RTC_WAR_TIRW_SHIFT                       (15U)                                               /*!< RTC_WAR.TIRW Position                   */
#define RTC_WAR_TIRW(x)                          (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< RTC_WAR.TIRW Field                      */
/* ------- RAR Bit Fields                           ------ */
#define RTC_RAR_TSRR_MASK                        (0x1U)                                              /*!< RTC_RAR.TSRR Mask                       */
#define RTC_RAR_TSRR_SHIFT                       (0U)                                                /*!< RTC_RAR.TSRR Position                   */
#define RTC_RAR_TSRR(x)                          (((uint32_t)(((uint32_t)(x))<<0U))&0x1UL)           /*!< RTC_RAR.TSRR Field                      */
#define RTC_RAR_TPRR_MASK                        (0x2U)                                              /*!< RTC_RAR.TPRR Mask                       */
#define RTC_RAR_TPRR_SHIFT                       (1U)                                                /*!< RTC_RAR.TPRR Position                   */
#define RTC_RAR_TPRR(x)                          (((uint32_t)(((uint32_t)(x))<<1U))&0x2UL)           /*!< RTC_RAR.TPRR Field                      */
#define RTC_RAR_TARR_MASK                        (0x4U)                                              /*!< RTC_RAR.TARR Mask                       */
#define RTC_RAR_TARR_SHIFT                       (2U)                                                /*!< RTC_RAR.TARR Position                   */
#define RTC_RAR_TARR(x)                          (((uint32_t)(((uint32_t)(x))<<2U))&0x4UL)           /*!< RTC_RAR.TARR Field                      */
#define RTC_RAR_TCRR_MASK                        (0x8U)                                              /*!< RTC_RAR.TCRR Mask                       */
#define RTC_RAR_TCRR_SHIFT                       (3U)                                                /*!< RTC_RAR.TCRR Position                   */
#define RTC_RAR_TCRR(x)                          (((uint32_t)(((uint32_t)(x))<<3U))&0x8UL)           /*!< RTC_RAR.TCRR Field                      */
#define RTC_RAR_CRR_MASK                         (0x10U)                                             /*!< RTC_RAR.CRR Mask                        */
#define RTC_RAR_CRR_SHIFT                        (4U)                                                /*!< RTC_RAR.CRR Position                    */
#define RTC_RAR_CRR(x)                           (((uint32_t)(((uint32_t)(x))<<4U))&0x10UL)          /*!< RTC_RAR.CRR Field                       */
#define RTC_RAR_SRR_MASK                         (0x20U)                                             /*!< RTC_RAR.SRR Mask                        */
#define RTC_RAR_SRR_SHIFT                        (5U)                                                /*!< RTC_RAR.SRR Position                    */
#define RTC_RAR_SRR(x)                           (((uint32_t)(((uint32_t)(x))<<5U))&0x20UL)          /*!< RTC_RAR.SRR Field                       */
#define RTC_RAR_LRR_MASK                         (0x40U)                                             /*!< RTC_RAR.LRR Mask                        */
#define RTC_RAR_LRR_SHIFT                        (6U)                                                /*!< RTC_RAR.LRR Position                    */
#define RTC_RAR_LRR(x)                           (((uint32_t)(((uint32_t)(x))<<6U))&0x40UL)          /*!< RTC_RAR.LRR Field                       */
#define RTC_RAR_IERR_MASK                        (0x80U)                                             /*!< RTC_RAR.IERR Mask                       */
#define RTC_RAR_IERR_SHIFT                       (7U)                                                /*!< RTC_RAR.IERR Position                   */
#define RTC_RAR_IERR(x)                          (((uint32_t)(((uint32_t)(x))<<7U))&0x80UL)          /*!< RTC_RAR.IERR Field                      */
#define RTC_RAR_TTSR_MASK                        (0x100U)                                            /*!< RTC_RAR.TTSR Mask                       */
#define RTC_RAR_TTSR_SHIFT                       (8U)                                                /*!< RTC_RAR.TTSR Position                   */
#define RTC_RAR_TTSR(x)                          (((uint32_t)(((uint32_t)(x))<<8U))&0x100UL)         /*!< RTC_RAR.TTSR Field                      */
#define RTC_RAR_MERR_MASK                        (0x200U)                                            /*!< RTC_RAR.MERR Mask                       */
#define RTC_RAR_MERR_SHIFT                       (9U)                                                /*!< RTC_RAR.MERR Position                   */
#define RTC_RAR_MERR(x)                          (((uint32_t)(((uint32_t)(x))<<9U))&0x200UL)         /*!< RTC_RAR.MERR Field                      */
#define RTC_RAR_MCLR_MASK                        (0x400U)                                            /*!< RTC_RAR.MCLR Mask                       */
#define RTC_RAR_MCLR_SHIFT                       (10U)                                               /*!< RTC_RAR.MCLR Position                   */
#define RTC_RAR_MCLR(x)                          (((uint32_t)(((uint32_t)(x))<<10U))&0x400UL)        /*!< RTC_RAR.MCLR Field                      */
#define RTC_RAR_MCHR_MASK                        (0x800U)                                            /*!< RTC_RAR.MCHR Mask                       */
#define RTC_RAR_MCHR_SHIFT                       (11U)                                               /*!< RTC_RAR.MCHR Position                   */
#define RTC_RAR_MCHR(x)                          (((uint32_t)(((uint32_t)(x))<<11U))&0x800UL)        /*!< RTC_RAR.MCHR Field                      */
#define RTC_RAR_TERR_MASK                        (0x1000U)                                           /*!< RTC_RAR.TERR Mask                       */
#define RTC_RAR_TERR_SHIFT                       (12U)                                               /*!< RTC_RAR.TERR Position                   */
#define RTC_RAR_TERR(x)                          (((uint32_t)(((uint32_t)(x))<<12U))&0x1000UL)       /*!< RTC_RAR.TERR Field                      */
#define RTC_RAR_TDRR_MASK                        (0x2000U)                                           /*!< RTC_RAR.TDRR Mask                       */
#define RTC_RAR_TDRR_SHIFT                       (13U)                                               /*!< RTC_RAR.TDRR Position                   */
#define RTC_RAR_TDRR(x)                          (((uint32_t)(((uint32_t)(x))<<13U))&0x2000UL)       /*!< RTC_RAR.TDRR Field                      */
#define RTC_RAR_TTRR_MASK                        (0x4000U)                                           /*!< RTC_RAR.TTRR Mask                       */
#define RTC_RAR_TTRR_SHIFT                       (14U)                                               /*!< RTC_RAR.TTRR Position                   */
#define RTC_RAR_TTRR(x)                          (((uint32_t)(((uint32_t)(x))<<14U))&0x4000UL)       /*!< RTC_RAR.TTRR Field                      */
#define RTC_RAR_TIRR_MASK                        (0x8000U)                                           /*!< RTC_RAR.TIRR Mask                       */
#define RTC_RAR_TIRR_SHIFT                       (15U)                                               /*!< RTC_RAR.TIRR Position                   */
#define RTC_RAR_TIRR(x)                          (((uint32_t)(((uint32_t)(x))<<15U))&0x8000UL)       /*!< RTC_RAR.TIRR Field                      */
/**
 * @} */ /* End group RTC_Register_Masks_GROUP 
 */

/* RTC - Peripheral instance base addresses */
#define RTC_BasePtr                    0x4003D000UL //!< Peripheral base address
#define RTC                            ((RTC_Type *) RTC_BasePtr) //!< Freescale base pointer
#define RTC_BASE_PTR                   (RTC) //!< Freescale style base pointer
#define RTC_IRQS { RTC_Alarm_IRQn, RTC_Seconds_IRQn,  }

/**
 * @} */ /* End group RTC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SIM_Peripheral_access_layer_GROUP SIM Peripheral Access Layer
* @brief C Struct for SIM
* @{
*/

/* ================================================================================ */
/* ================           SIM (file:SIM_MK11D5WS)              ================ */
/* ================================================================================ */

